var app = new Vue({
  el: '#app',
  data: {
  	i: 'あたし',
    you: 'あなた',
  }
})

/*
text = '''
IYouに会えて本当に嬉しいのに
当たり前のようにそれら全てが悲しいんだ
今　痛いくらい幸せな思い出が
いつか来るお別れを育てて歩く

誰かの居場所を奪い生きるくらいならもう
Iは石ころにでもなれたならいいな
だとしたら勘違いも戸惑いも無い
そうやってYouまでも知らないままで
YouにIの思いが全部伝わってほしいのに
誰にも言えない秘密があって嘘をついてしまうのだ
Youが思えば思うよりいくつもIは意気地ないのに
どうして どうして どうして

消えない悲しみも綻びもYouといれば
「それでよかったね」と笑えるのがどんなに嬉しいか
目の前の全てがぼやけては溶けていくような
奇跡であふれて足りないや
Iの名前を呼んでくれた

Youが居場所なくし彷徨うくらいならばもう
誰かが身代わりになればなんて思うんだ
今　ささやかで確かな見ないふり
きっと繰り返しながら笑い合うんだ

何度誓っても何度祈っても惨憺たる夢を見る
小さな歪みがいつかYouを呑んでなくしてしまうような
Youが思えば思うより大げさにIは不甲斐ないのに
どうして どうして どうして

お願い　いつまでもいつまでも超えられない夜を
超えようと手をつなぐこの日々が続きますように
閉じた瞼さえ鮮やかに彩るために
そのために何ができるかな
Youの名前を呼んでいいかな

産まれてきたその瞬間にI
「消えてしまいたい」って泣き喚いたんだ
それからずっと探していたんだ
いつか出会えるYouのことを

消えない悲しみも綻びもあなたといれば
「それでよかったね」と笑えるのがどんなに嬉しいか
目の前の全てがぼやけては溶けてゆくような
奇跡であふれて足りないや
Iの名前を呼んでくれた
Youの名前を呼んでいいかな
'''
I = input("自分の名前を入力してください")
You = input("相手の名前を入力してください")
text = text.replace("I", I)
text = text.replace("You", You)
*/
